import java.util.Scanner;

public class 용의자 {

    public static Scanner scanner = new Scanner(System.in);
    String 이름;
    int 공격력, 체력, 방어력;

    public void 용의자상태창() {
        this.이름 = 이름;
        this.공격력 = 공격력;
        this.방어력 = 방어력;
        if (this.체력 > 0) {
            this.체력 = 체력;
        } else {
            this.체력 = 0;
        }

        System.out.println("이름 :" + 이름);
        System.out.println("공격력 :" + 공격력);
        System.out.println("체력 :" + 체력);
        System.out.println("방어력 :" + 방어력);
    }

    public 용의자(String 이름, int 공격력, int 체력, int 방어력)
    {
        this.이름 = 이름;
        this.공격력 = 공격력;
        this.방어력 = 방어력;
        this.체력 = 체력;
    }

    public void 용의자취조성공(Player Player, 용의자 용의자)
    {
        System.out.println(용의자 + "체력이 0이 되어 결정적 증언을 얻었습니다");
        System.out.println(
                        ".　　  ＿＿＿     \n" +
                        " 　／　  ―　  ＼\n" +
                        " ／ノ　  ( ●)　 ＼\n" +
                        "｜  ( ●)　  ⌒) ｜\n" +
                        "｜　　(＿ノ￣　 　/\n" +
                        "｜　　　　　 　  /\n" +
                        " ＼＿　　  ⊂ヽ∩＼\n" +
                        "　/   　　  (＿＼");
        System.out.println("'훗 역시 나의 취조실력이란..'");
    }

    public void 용의자검거성공(Player Player, 용의자 용의자)
    {
        System.out.println(" ");
        System.out.println(" ");
        System.out.println(" ");
        System.out.println(
                """
                                    ─━━━━━━━━━━━━━━━━━━━━━━━━⊱༻ ⚪ ༺⊰━━━━━━━━━━━━━━━━━━━━━━━━─
                                    
                                                            CRIME SCENE
                                                            축하합니다!
                                                  내사 종결 시간안에 범인을 검거하였습니다
                                                       
                                                             최종 범인은
                                    """);

        System.out.println("[[[ " + 용의자.이름 + " ]]] 입니다!" );
        System.out.println("─━━━━━━━━━━━━━━━━━━━━━━━━⊱༻ ⚪ ༺⊰━━━━━━━━━━━━━━━━━━━━━━━━─");
        System.out.println(" ");
        System.out.println(" ");
        System.out.println(
                " ..............┏━━━┓...... ....┏━━━┓\n" +
                "............. ┃▩▩▩┃..........┃▩▩▩┃\n" +
                "...............┃▩▩▩┃........┃▩▩▩┃\n" +
                "...............┃▩▩▩┃........┃▩▩▩┃\n" +
                "................┃▩▩▩┃......┃▩▩▩┃\n" +
                "................┃▩▩▩┃......┃▩▩▩┃\n" +
                ".................┃▩▩▩┃....┃▩▩▩┃\n" +
                ".................┃▩▩▩┃....┃▩▩▩┃\n" +
                "..................┃▩▩▩┃..┃▩▩▩┃\n" +
                "..................┃▩▩▩┃..┃▩▩▩┃\n" +
                "...................┃▩▩▩┃┃▩▩▩┣━━━━┳━━━━━┓\n" +
                "...................┃▩▩▩┃┃▩▩▩┃▩▩▩┃▩▩▩┃\n" +
                "...................┃▩▩▩┃▩▩▩ ┃▩▩▩┃▩▩▩┃\n" +
                "...................┃▩▩▩┃▩▩▩ ┃▩▩▩┃▩▩▩┃\n" +
                "..............┏━━━━━┻━━━━┻━┓▩▩┃▩▩▩┃▩▩▩┃\n" +
                "..............┃▩▩▩▩▩▩▩▩┃▩▩┃▩▩▩┃▩▩▩┣┓\n" +
                "..............┃▩▩▩▩▩▩▩▩┃▩▩┃▩▩▩┃▩▩▩┃┃\n" +
                "..............┃▩▩▩▩▩▩▩▩┃▩▩┗━━━━┻━━━━━┛┃\n" +
                "..............┃▩▩▩┏━━━━━━━┛▩▩▩▩▩▩▩▩▩▩┃\n" +
                "..............┃▩▩▩┃▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩┃\n" +
                "..............┃▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩┃\n" +
                "..............┃▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩┃\n" +
                "..............┗━┓▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩┃\n" +
                "................┗┓▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩┃\n" +
                ".................┃▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩┃\n" +
                ".................┗━┓▩▩▩▩▩▩▩▩▩▩▩▩▩▩▩┏┛\n" +
                "....................┃▩▩▩▩▩▩▩▩▩▩▩▩▩┏━");

        System.out.println("이제 다음 에피소드로 넘어갈 수 있습니다!");
    }

}
