public class 팀원{

    String 아이템name;
    int 가격;
    int 돋보기증가;
    int 체력UP;
    int 공격력UP;
    int 방어력UP;

    public 팀원(String 아이템name, int 가격, int 돋보기증가, int 체력UP, int 공격력UP, int 방어력UP)
    {
        this.아이템name = 아이템name;
        this.가격 = 가격;
        this.돋보기증가 = 돋보기증가;
        this.체력UP = 체력UP;
        this.공격력UP = 공격력UP;
        this.방어력UP = 방어력UP;
    }

//    public 팀원(String 아이템name, int 가격, int 돋보기증가, int 체력UP, int 공격력UP, int 방어력UP) {
//        super(아이템name, 가격, 돋보기증가, 체력UP, 공격력UP, 방어력UP);
//    }

    public void 현장감식원()
    {
        this.가격 = 200;
        this.돋보기증가 = 10;

        System.out.println(
                """
                        ╔════════════════════════════════════════════╗
                              직업) 현장감식원
                              설명) 현장에서 자동으로 증거물을 채취한다
                              증거유형) 족적, 혈흔, 지문, DNA감식
                              고용비용) 돋보기 200
                              돋보기증가) 10/30초마다
                        ═════════════════════════════════════════════""");
    }

    public void 프로파일러()
    {
        this.가격 = 300;
        this.돋보기증가 = 15;
        //자백유도전략업무
        System.out.println(
                """
                        ═════════════════════════════════════════════
                              직업) 프로파일러
                              설명) 프로파일링한 정보를 일정 시간마다 준다
                              증거유형) 범죄자 행동 분석, 범죄유형 파악
                              고용비용) 돋보기 300
                              돋보기증가) 15/30초마다
                        ═════════════════════════════════════════════""");
    }

    public void 법의학자()
    {
        this.가격 = 400;
        this.돋보기증가 = 20;

        System.out.println(
                """
                        ═════════════════════════════════════════════
                              직업) 법의학자
                              설명) 시신에 대한 정보를 일정 시간마다 준다
                              증거유형) 시신부검, 사망추정시각
                              고용비용) 돋보기 400
                              돋보기증가) 20/30초마다
                        ═════════════════════════════════════════════""");
    }
    public void 허둥지둥조수()
    {
        this.가격 = 100;
        this.돋보기증가 = 5;
        System.out.println(
                """
                        ═════════════════════════════════════════════
                              직업) 허둥지둥조수
                              설명) 뭘 하든 어설프지만 없는 것보다는 낫다
                              증거유형) 증언모으기, 몽타주그리기, 훼방꾼 쫒기
                              고용비용) 돋보기 100
                              돋보기증가) 5/30초마다
                        ═════════════════════════════════════════════""");
    }
    public void 영상분석가()
    {
        this.가격 = 500;
        this.돋보기증가 = 30;

        System.out.println(
                """
                        ═════════════════════════════════════════════
                              직업) 현장감식원
                              설명) 영상증거에 대한 정보를 일정 시간마다 준다
                              증거유형) CCTV분석
                              고용비용) 돋보기 500
                              돋보기증가) 30/30초마다
                        ═════════════════════════════════════════════""");
    }

}
